# ToposolidContourDisplaySettingsIdParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ToposolidContourDisplaySettingsIdParam Property
ParameterTypeId Class See Also
---
"Contour Display"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ToposolidContourDisplaySettingsIdParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ToposolidContourDisplaySettingsIdParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ToposolidContourDisplaySettingsIdParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace